Autodesk.Revit.DB.Structure.Hub.GetHubConnectorManager
Retrieves the ConnectorManager of the Hub.
Remarks:
The ConnectorManager provides information about elements connected via the Hub.
Returns:
The ConnectorManager.
Since:
2012

Autodesk.Revit.DB.Structure.Hub.GetOrigin
Retrieves position of a Hub if such position is a 3D point.
Returns:
The origin.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Hub does not have an Origin.
Since:
2012

Autodesk.Revit.DB.Structure.Hub.HasOrigin
Provides information if Hub has a specific location at point in 3D space.
Returns:
True if the Hub has a specific location at point in 3D space.
Since:
2012

Autodesk.Revit.DB.Structure.Hub
Represents a connection between two or more Autodesk Revit Elements.
Remarks:
Elements connected via a Hub do not refer directly to each other - they each refer to the Hub that keeps all the connectivity information.
Hubs connect only structural Analytical Model Elements.
Since:
2012